****
## JSON exercise

Using data in file 'data/world_bank_projects.json' and the techniques demonstrated above,
1. Find the 10 countries with most projects
2. Find the top 10 major project themes (using column 'mjtheme_namecode')
3. In 2. above you will notice that some entries have only the code and the name is missing. Create a dataframe with the missing names filled in.

In [17]:
import pandas as pd
import json
from pandas.io.json import json_normalize
import numpy as np
from numpy import NaN

# Question 1 : Find the 10 countries with most projects

In [8]:
data = pd.read_json('data/world_bank_projects.json')

Active Projects

In [9]:
filtered_data = data[data['projectstatusdisplay'] == 'Active']

Top 10 countries with most projects

In [10]:
most_projects = filtered_data.groupby('countryname')['projectstatusdisplay'].count()
most_projects = most_projects.reset_index()
most_projects.sort_values(ascending = False, by='projectstatusdisplay').head(10)

                         countryname  projectstatusdisplay
37        People's Republic of China                    19
60             Republic of Indonesia                    16
59                 Republic of India                    15
101    Socialist Republic of Vietnam                    14
91                 Republic of Yemen                    13
36   People's Republic of Bangladesh                    12
32                             Nepal                    11
0                             Africa                    11
18      Islamic Republic of Pakistan                     9
72            Republic of Mozambique                     9

# Question 2 : Find the top 10 major project themes (using column 'mjtheme_namecode')

In [11]:
#loading json file as string
data = json.load(open('data/world_bank_projects.json'))

In [12]:
# using normalization to create tables from nested element
data1 = json_normalize(data, 'mjtheme_namecode')

In [13]:
# Grouping the data using column 'mjtheme_namecode'and printing the top 10 project themes in descending order
data2 = data1.groupby(['code', 'name']).size() 
data2.sort_values(ascending = False).head(10)

code  name
11    Environment and natural resources management    223
10    Rural development                               202
8     Human development                               197
2     Public sector governance                        184
6     Social protection and risk management           158
4     Financial and private sector development        130
7     Social dev/gender/inclusion                     119
5     Trade and integration                            72
9     Urban development                                47
1     Economic management                              33
dtype: int64

# Question 3 : Create a dataframe with the missing names filled in.

In [14]:
data = json.load(open('data/world_bank_projects.json'))

In [15]:
data3 = json_normalize(data, 'mjtheme_namecode')
data3.head()

  code                                   name
0    8                      Human development
1   11
2    1                    Economic management
3    6  Social protection and risk management
4    5                  Trade and integration

In [18]:
# Replacing empty spaces with null
data3.replace('', NaN, inplace=True)
data3.head()

  code                                   name
0    8                      Human development
1   11                                    NaN
2    1                    Economic management
3    6  Social protection and risk management
4    5                  Trade and integration

In [19]:
# Creating a dataframe with the missing names filled in 
data3['name'] = data3.groupby('code')['name'].transform(lambda x: x.fillna(x.value_counts().idxmax()))
data3.head()

  code                                          name
0    8                             Human development
1   11  Environment and natural resources management
2    1                           Economic management
3    6         Social protection and risk management
4    5                         Trade and integration